# Задача 24:
# В фермерском хозяйстве в Карелии выращивают чернику.
# Она растёт на круглой грядке, причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.

# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

# from random import randint

# n = int(input("Введите размера списка: "))
# list = [randint(1, 12) for _ in range(n)]

# print(list)

# res = [sum(list[i:i+3]) for i in range(len(list))]

# print(res)

from random import randint

n = int(input("Введите размера списка: "))
list = [randint(1, 12) for _ in range(n)]
print(list)

arr_count = []
for i in range(len(list)-1):
    arr_count.append(list[i-1]+list[i]+list[i+1])
arr_count.append(list[-2]+list[-1]+list[0])
print(max(arr_count))
