# Задача 32:
# Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

from random import randint

number = int(input('Введите размер массива: '))
list_1 = [randint(-10, 20) for _ in range(number)]

print(list_1)

minN = int(input('Задайте минимальное число диапозона: '))
maxN = int(input('Задайте максимальное число диапозона: '))

list_2 = []

for i in range(number):
    if minN <= list_1[i] <= maxN:
        list_2.append(i)

print(list_2)
