# Задача 30:
# Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии:
# An = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

num1 = int(input('Введите первый элемент: '))
num2 = int(input('Введите разность: '))
num3 = int(input('Введите количество элементов: '))

list_1 = []

for i in range(num3):
    res = num1 + i * num2
    list_1.append(res)

print(list_1)
