# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3

numberX = int(input("Петя загадал число X = "))
numberY = int(input("Петя загадал число Y = "))

print("Подсказки:")
print(f"Сумма первого и второго числа = {numberX+numberY}")
print(f"Произведение первого и второго числа = {numberX*numberY}")

print("Какие числа загадал Петя?")
numberXanswer = int(input("Петя загадал число X = "))
numberYanswer = int(input("Петя загадал число Y = "))

if numberXanswer == numberX and numberYanswer == numberY:
    print("Верно")
else:
    print("Не угадали")
