# Задача 16:
# Требуется вычислить, сколько раз встречается некоторое число X в массиве A.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai (можно использовать псевдогенерацию).
# Последняя строка содержит число X.

# *Пример:*

# 5
#     7 -2 3 5 1
#     3
#     -> 1

from random import randint

number = int(input("Введите количество элементов массива: "))

list = [randint(-5, 9) for _ in range(number)]

print(list)

number2 = int(input("Какое число хотите найти: "))
count = 0

for item in list:
    if item == number2:
        count += 1
print(count)
